Revit 2024 API
FailureHandlingOptions.SetFailuresPreprocessor Method
 Sets the callback to be invoked in the beginning of failure processing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailureHandlingOptions SetFailuresPreprocessor(
	IFailuresPreprocessor preprocessor
)
Visual Basic
Public Function SetFailuresPreprocessor ( _
	preprocessor As IFailuresPreprocessor _
) As FailureHandlingOptions
Visual C++
public:
FailureHandlingOptions^ SetFailuresPreprocessor(
	IFailuresPreprocessor^ preprocessor
)
Parameters
preprocessor
Type: Autodesk.Revit.DB.IFailuresPreprocessor
 The callback to be invoked in the beginning of failure processing.
Return Value
 This FailureHandlingOptions object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace